{"class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 455]}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"bias": true, "name": "dense_1", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 455, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "name": "batchnormalization_1", "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias": true, "name": "dense_2", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 100, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "name": "batchnormalization_2", "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"bias": true, "name": "dense_3", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 100, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "name": "batchnormalization_3", "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"bias": true, "name": "dense_4", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "trainable": true, "input_dim": 100, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "name": "batchnormalization_4", "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_4", 0, 0]]}, "keras_version": "1.2.2"}